Model: "feature_extractor_stage3"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_4 (InputLayer)        [(None, 5)]               0         
                                                                 
 fe_bayes_0 (DenseFlipout)   (None, 16)                192       
                                                                 
 fe_bayes_1 (DenseFlipout)   (None, 16)                544       
                                                                 
 fe_bayes_2 (DenseFlipout)   (None, 16)                544       
                                                                 
 fe_bayes_3 (DenseFlipout)   (None, 16)                544       
                                                                 
 fe_bayes_4 (DenseFlipout)   (None, 16)                544       
                                                                 
=================================================================
Total params: 2368 (9.25 KB)
Trainable params: 2368 (9.25 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
