Model: "feature_extractor"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 5)]               0         
                                                                 
 fe_dense_0 (Dense)          (None, 16)                96        
                                                                 
 fe_dense_1 (Dense)          (None, 16)                272       
                                                                 
 fe_dense_2 (Dense)          (None, 16)                272       
                                                                 
 fe_dense_3 (Dense)          (None, 16)                272       
                                                                 
 feature_layer (Dense)       (None, 16)                272       
                                                                 
=================================================================
Total params: 1184 (4.62 KB)
Trainable params: 1184 (4.62 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
