Model: "regressor_head_bayesian"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_5 (InputLayer)        [(None, 16)]              0         
                                                                 
 reg_bnn_out (DenseFlipout)  (None, 2)                 68        
                                                                 
=================================================================
Total params: 68 (272.00 Byte)
Trainable params: 68 (272.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
