Model: "regressor_head"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_2 (InputLayer)        [(None, 16)]              0         
                                                                 
 regressor_head (Dense)      (None, 1)                 17        
                                                                 
=================================================================
Total params: 17 (68.00 Byte)
Trainable params: 17 (68.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
