Model: "feature_extractor_stage3"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_44 (InputLayer)       [(None, 5)]               0         
                                                                 
 fe_bayes_0 (DenseFlipout)   (None, 10)                120       
                                                                 
 fe_bayes_1 (DenseFlipout)   (None, 18)                396       
                                                                 
 fe_bayes_2 (DenseFlipout)   (None, 26)                988       
                                                                 
 fe_bayes_3 (DenseFlipout)   (None, 26)                1404      
                                                                 
 fe_bayes_4 (DenseFlipout)   (None, 17)                918       
                                                                 
=================================================================
Total params: 3826 (14.95 KB)
Trainable params: 3826 (14.95 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
