Model: "regressor_head_bayesian"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_45 (InputLayer)       [(None, 17)]              0         
                                                                 
 reg_bnn_out (DenseFlipout)  (None, 2)                 72        
                                                                 
=================================================================
Total params: 72 (288.00 Byte)
Trainable params: 72 (288.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
